module.exports.info = {
    name: 'level',
    usage: "<уровень>",
    aliases: ['lvl', 'level', 'уровень', 'уровни'],
    description: 'награда за уровни',
    permission: 1,
    enabled: true,
    sponsor: [],
    help: true
};

module.exports.run = async (context, params) => {
    const data = params[1]
    if (!data) return context.reply(`🔎 Вы забыли один из аргументов этой команды.\n\nПравильное использование: ${params[0]} <уровень>`)
    const levels = {
        1: "● 4000 коинов",
        2: "● Сундук нуба 3 шт.",
        3: "● 5000 коинов",
        4: "● Множитель коинов x2 на 6 часов",
        5: "● 6000 коинов",
        6: "● Древний сундук",
        7: "● Множитель коинов x2 на 6 часов",
        8: "● 8000 коинов",
        9: "● Древний сундук 2 шт.",
        10: "● 10000 коинов",
        11: "● Множитель коинов x2 на 12 часов",
        12: "● 12000 коинов",
        13: "● Древний сундук 3 шт.",
        14: "● Множитель коинов x2 на 1 день",
        15: "\n● Макс. количество друзей - 30\n● Макс. размер группы - 6\n● 14000 коинов",
        16: "● 16000 коинов",
        17: "● 18000 коинов",
        18: "● Мистический сундук",
        19: "● 20000 коинов",
        20: "● Множитель коинов x3 на 6 часов",
        21: "● 22000 коинов",
        22: "● Множитель коинов x3 на 6 часов",
        23: "● 24000 коинов",
        24: "● Мистический сундук 2 шт.",
        25: "● Множитель коинов x3 на 12 часов",
        26: "● 26000 коинов",
        27: "● Мистический сундук 2 шт.",
        28: "● 28000 коинов",
        29: "● Множитель коинов x3 на 12 часов",
        30: "\n● Макс. количество друзей - 50\n● Макс. размер группы - 7\n● 30000 коинов",
        31: "● Мистический сундук 2 шт.",
        32: "● Множитель коинов x3 на 12 часов (x2)",
        33: "● 32000 коинов",
        34: "● 34000 коинов",
        35: "● Мистический сундук 2 шт.",
        36: "● Множитель коинов x3 на 12 часов (x2)",
        37: "● 36000 коинов",
        38: "● 38000 коинов",
        39: "● 40000 коинов",
        40: "● Мистический сундук 2 шт.",
        41: "● Множитель коинов x3 на 12 часов (x2)",
        42: "● Мистический сундук 3 шт.",
        43: "● Мистический сундук 3 шт.",
        44: "● 42000 коинов",
        45: "● Множитель коинов x3 на 12 часов (x3)",
        46: "● Множитель коинов x3 на 1 день (x3)",
        47: "● 44000 коинов",
        48: "● 46000 коинов",
        49: "● 48000 коинов",
        50: "● 50000 коинов",
        51: "● Мистический сундук 3 шт.",
        52: "● Мистический сундук 4 шт.",
        53: "● Мистический сундук 4 шт.",
        54: "● Мистический сундук 4 шт.",
        55: "● 52000 коинов",
        56: "● Множитель коинов x3 на 1 день (x4)",
        57: "● 54000 коинов",
        58: "● 56000 коинов",
        59: "● 58000 коинов",
    }


    if (data > 59) {
        context.send({
            message: `📄 Награда за достижение ${data} уровня отсутствует`,
            reply_to: context.message.id
        })
    } else if (!levels[data]) {
        context.send({
            message: `📄 Уровень должен быть числом`,
            reply_to: context.message.id
        })
    } else {
        context.send({
            message: `📄 Награда за достижение ${data} уровня:\n${levels[data]}`,
            reply_to: context.message.id
        });
    }
};

module.exports.runPayload = async (context) => {
    this.run(context, context.messagePayload.split(':'))
};